app/controllers/songs_controller.rb

  def upload
    CSV.foreach(params[:file].path, headers: true) do |song|
       Song.create(title: song[0], artist_name: song[1])
---
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2019-02-26 18:41:16.949987"], ["updated_at", "2019-02-26 18:41:16.949987"]]
INSERT INTO "songs" ("title", "created_at", "updated_at", "artist_id") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["created_at", "2019-02-26 18:41:16.954074"], ["updated_at", "2019-02-26 18:41:16.954074"], ["artist_id", 137]]